app/views/concerts/show.html.erb

SELECT "setlists".* FROM "setlists" WHERE "setlists"."concert_id" = $1  [["concert_id", 41]]
---
<ol>
  <% @concert.setlists.sort_by(&:index).each do |track| %>