app/controllers/concerts_controller.rb

  def index
    @concerts = Concert.all
---
SELECT "concerts".* FROM "concerts"

  def show
    @spotify_link = params[:external_url]
    @concert = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def destroy
    @concert.destroy
---
DELETE FROM "concerts" WHERE "concerts"."id" = $1  [["id", 47]]

  def current_concert
    @concert = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]