app/controllers/playlists_controller.rb

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT "setlists".* FROM "setlists" WHERE "setlists"."concert_id" = $1  [["concert_id", 47]]
---
  def create_spotify_playlist
    spotify_user = RSpotify::User.new(session[:spotify_user])
    concert = Concert.find(params[:concert_id])
    spotify_track_ids = concert.setlists.sort_by(&:index).map(&:song).pluck(:spotify_id).reject(&:blank?)
    spotify_tracks = []
    spotify_track_ids.each do |track_id|