app/controllers/search_results_controller.rb

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."setlistfm_id" = $1 LIMIT $2  [["setlistfm_id", "2b949c22"], ["LIMIT", 1]]
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."setlistfm_id" = $1 LIMIT $2  [["setlistfm_id", "4b9e072e"], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Nightwish"], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Visions of Atlantis"], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" WHERE "venues"."name" = $1 LIMIT $2  [["name", "Gatorade Center"], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" WHERE "venues"."name" = $1 LIMIT $2  [["name", "Backstage Club"], ["LIMIT", 1]]
INSERT INTO "artists" ("name", "created_at", "updated_at", "spotify_id", "genres", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "venues" ("name", "city", "country", "created_at", "updated_at", "setlist_fm_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Gatorade Center"], ["city", "Turku"], ["country", "Finland"], ["created_at", "2019-08-08 21:05:29.888693"], ["updated_at", "2019-08-08 21:05:29.888693"], ["setlist_fm_id", "23d554ff"]]
INSERT INTO "concerts" ("date", "artist_id", "venue_id", "created_at", "updated_at", "tour") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2018-12-14"], ["artist_id", 1], ["venue_id", 1], ["created_at", "2019-08-08 21:45:36.033515"], ["updated_at", "2019-08-08 21:45:36.033515"], ["tour", "Decades: World Tour"]]
SELECT  "songs".* FROM "songs" ORDER BY "songs"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = $1 AND "songs"."artist_id" = $2 LIMIT $3  [["name", "Dark Chest of Wonders"], ["artist_id", 1], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = $1 AND "songs"."artist_id" = $2 LIMIT $3  [["name", "Dark Chest of Wonders"], ["artist_id", 3], ["LIMIT", 1]]
INSERT INTO "songs" ("name", "album_id", "created_at", "updated_at", "spotify_id", "artist_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Rock and Roll"], ["album_id", 2], ["created_at", "2019-08-10 12:14:11.752686"], ["updated_at", "2019-08-10 12:14:11.752686"], ["spotify_id", "0fCWbJq1hagsRgShtn6gIU"], ["artist_id", 4]]
INSERT INTO "concerts" ("date", "artist_id", "venue_id", "created_at", "updated_at", "setlistfm_id", "tour") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "setlists" ("concert_id", "song_id", "index", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["concert_id", 35], ["song_id", 3], ["index", "1"], ["created_at", "2019-08-10 12:14:44.347784"], ["updated_at", "2019-08-10 12:14:44.347784"]]
---
  def search_concert
    concert_id = extract_setlist_id(search_params[:url])
    concert = Concert.find_by(setlistfm_id: concert_id)

    if concert.present?
      redirect_to concert_path(concert)
      # Add an alert to say that the concert is already present in our database.
    else
      json = get_request_for_url("#{ENV['SETLIST_FM_URL']}setlist/#{concert_id}")

      artist_name = json['artist']['name']
      artist = Artist.find_by(name: artist_name)
      artist = import_spotify_artist(artist_name) unless artist.present?

      venue_hash = json['venue']
      venue = Venue.find_by(name: venue_hash['name'])
      venue = create_venue(venue_hash) unless venue.present?
      concert = Concert.create(date: DateTime.parse(json['eventDate']), artist_id: artist.id, venue_id: venue.id, tour: json['tour']['name'])
      setlist = json['sets']['set'][0]['song']
      index = 0
      setlist.each do |song|
        next if song['name'].blank?
        index += 1
        song_name = song['name']
        saved_song = Song.find_by(name: song_name, artist_id: artist.id)
        saved_song = import_song(song_name, artist_name) unless saved_song.present?
        concert.setlists.create(concert_id: concert.id, song_id: saved_song.id)

INSERT INTO "artists" ("name", "created_at", "updated_at", "spotify_id", "genres", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def import_spotify_artist(artist_name)
    artists = RSpotify::Artist.search(artist_name)

    if artists.count.eql?(1)
      spotify_artist = artists[0]
    else
      artists.each_with_index do |artist, index|
        next unless artist.name.eql?(artist_name)
        next unless artist.popularity > artists[index-1].popularity
        spotify_artist = artist
      end
    end
    Artist.create(name: spotify_artist.name, spotify_id: spotify_artist.id, genres: spotify_artist.genres, image: spotify_artist.images.first['url'])

SELECT  "albums".* FROM "albums" WHERE "albums"."spotify_id" = $1 LIMIT $2  [["spotify_id", "56mtsjHZT6BBnCw0MCy3Mr"], ["LIMIT", 1]]
INSERT INTO "artists" ("name", "created_at", "updated_at", "spotify_id", "genres", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "albums".* FROM "albums" WHERE "albums"."spotify_id" = $1 AND "albums"."artist_id" = $2 LIMIT $3  [["spotify_id", "2vaeoAzATVgE2npjBCnH5x"], ["artist_id", 3], ["LIMIT", 1]]
INSERT INTO "albums" ("artist_id", "created_at", "updated_at", "spotify_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 4], ["created_at", "2019-08-10 12:14:11.731528"], ["updated_at", "2019-08-10 12:14:11.731528"], ["spotify_id", "1qjBjGoc5UCL8dg7q72UVP"]]
INSERT INTO "songs" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Ark"], ["created_at", "2019-09-08 08:30:30.664872"], ["updated_at", "2019-09-08 08:30:30.664872"]]
---
  def import_song(song_name, artist_name)
    songs = RSpotify::Track.search(song_name).reject{|song| !song.artists.map(&:name).include?(artist_name)}
    spotify_song = songs.select{|song| song.popularity.eql?(songs.map(&:popularity).max)}[0]
    spotify_song_album = spotify_song.album
    album = Album.find_or_create_by(spotify_id: spotify_song_album.id)
    Album.create(name: spotify_song_album.name, date: DateTime.parse(spotify_song_album.release_date), artist_id: Artist.find(artist_name).id, spotify_id: spotify_song_album.id) unless album.present?
    Song.create(name: song_name, album_id: album.id, spotify_id: spotify_song.id)

INSERT INTO "venues" ("name", "city", "country", "created_at", "updated_at", "setlist_fm_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hartwall Areena"], ["city", "Helsinki"], ["country", "Finland"], ["created_at", "2019-08-10 12:03:33.118054"], ["updated_at", "2019-08-10 12:03:33.118054"], ["setlist_fm_id", "63d61e53"]]
---
  def create_venue(venue_json)
    venue_json
    Venue.create(name: venue_json['name'], city: venue_json['city']['name'], country: venue_json['city']['country']['name'], setlist_fm_id: extract_setlist_id(venue_json['url']))