app/controllers/setlists_controller.rb

  def find_setlist
    @concert_id = extract_setlist_id(search_params)
    concert = Concert.find_by(setlistfm_id: @concert_id)
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."setlistfm_id" = $1 LIMIT $2  [["setlistfm_id", "1b9f7594"], ["LIMIT", 1]]

  def create_setlist(json)
    # Artist
    artist_name = json.dig('artist', 'name')
    artist = Artist.find_by(name: artist_name)
    artist ||= import_spotify_artist(artist_name)
    # Venue
    venue_hash = json['venue']
    venue = Venue.find_by(name: venue_hash['name'])
    venue ||= create_venue(venue_hash)
    # Concert
    @concert = Concert.create!(date: DateTime.parse(json['eventDate']), artist_id: artist.id, venue_id: venue.id, tour: json.dig('tour', 'name'), setlistfm_id: @concert_id)
    # Setlist
    setlist = []
    @concert_setlist.each{|set| setlist << set['song']}
    song_pool = RSpotify::Artist.find(artist.spotify_id).albums.uniq(&:name).map(&:tracks).flatten
    setlist.flatten.reject{|hash| hash['name'].blank?}.each_with_index do |song, index|
      song_name = song['name']
      saved_song = Song.find_by(name: song_name, artist_id: artist.id)
      saved_song ||= import_song(song_name, song_pool, artist)
      @concert.setlists.create!(song_id: saved_song.id, index: index += 1)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "U2"], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" WHERE "venues"."name" = $1 LIMIT $2  [["name", "Mercedes-Benz Arena"], ["LIMIT", 1]]
INSERT INTO "venues" ("name", "city", "country", "created_at", "updated_at", "setlist_fm_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "concerts" ("date", "artist_id", "venue_id", "created_at", "updated_at", "setlistfm_id", "tour") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = $1 AND "songs"."artist_id" = $2 LIMIT $3  [["name", "It's a Beautiful World"], ["artist_id", 5], ["LIMIT", 1]]
INSERT INTO "setlists" ("concert_id", "song_id", "created_at", "updated_at", "index") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["concert_id", 17], ["song_id", 62], ["created_at", "2019-09-08 11:14:22.837100"], ["updated_at", "2019-09-08 11:14:22.837100"], ["index", 1]]

  def import_spotify_artist(artist_name)
    artists = RSpotify::Artist.search(artist_name)

    if artists.count.eql?(1)
      spotify_artist = artists[0]
    else
      artists.each_with_index do |artist, index|
        next unless artist.name.eql?(artist_name)
        next unless artist.popularity > artists[index-1].popularity
        spotify_artist = artist
      end
    end
    Artist.create!(name: spotify_artist.name, spotify_id: spotify_artist.id, genres: spotify_artist.genres, image: spotify_artist.images.first['url'])
---
INSERT INTO "artists" ("name", "created_at", "updated_at", "spotify_id", "genres", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def import_song(song_name, song_pool, artist)
    spotify_songs = song_pool.select{ |spotify_track| spotify_track.name.eql?(song_name)}
    spotify_song = spotify_songs.find{ |song| song.popularity.eql?(spotify_songs.map(&:popularity).max) }

    if spotify_song.nil?
      Song.create!(name: song_name)
    else
      spotify_song_album = spotify_song.album
      album = Album.find_or_create_by!(spotify_id: spotify_song_album.id, artist: artist)
      Album.update!(name: spotify_song_album.name, date: DateTime.parse(spotify_song_album.release_date), artist_id: artist.id) unless album.present?
      Song.create!(name: song_name, album_id: album.id, spotify_id: spotify_song.id, artist_id: artist.id)
---
INSERT INTO "songs" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Transylvania"], ["created_at", "2019-09-08 10:52:08.902240"], ["updated_at", "2019-09-08 10:52:08.902240"]]
INSERT INTO "artists" ("name", "created_at", "updated_at", "spotify_id", "genres", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "albums" ("artist_id", "created_at", "updated_at", "spotify_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 5], ["created_at", "2019-09-08 11:14:22.939541"], ["updated_at", "2019-09-08 11:14:22.939541"], ["spotify_id", "3TbG4ZvwHmzkU9JGltkxnf"]]
SELECT  "albums".* FROM "albums" WHERE "albums"."spotify_id" = $1 AND "albums"."artist_id" = $2 LIMIT $3  [["spotify_id", "3TbG4ZvwHmzkU9JGltkxnf"], ["artist_id", 5], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."spotify_id" = $1 AND "albums"."artist_id" = $2 LIMIT $3  [["spotify_id", "4EBp4auyuzkB2Zl8IEdIai"], ["artist_id", 3], ["LIMIT", 1]]
INSERT INTO "albums" ("artist_id", "created_at", "updated_at", "spotify_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 3], ["created_at", "2019-09-08 10:35:26.135242"], ["updated_at", "2019-09-08 10:35:26.135242"], ["spotify_id", "4EBp4auyuzkB2Zl8IEdIai"]]
INSERT INTO "songs" ("name", "album_id", "created_at", "updated_at", "spotify_id", "artist_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "The Blackout"], ["album_id", 13], ["created_at", "2019-09-08 11:14:22.945044"], ["updated_at", "2019-09-08 11:14:22.945044"], ["spotify_id", "6hvvzf1aoqGtXKIS6ivrDR"], ["artist_id", 5]]

  def create_venue(venue_json)
    Venue.create!(name: venue_json['name'], city: venue_json.dig('city', 'name'), country: venue_json.dig('city', 'country', 'name'), setlist_fm_id: extract_setlist_id(venue_json['url']))
---
INSERT INTO "venues" ("name", "city", "country", "created_at", "updated_at", "setlist_fm_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"