app/controllers/users_controller.rb

  def create_playlist
    @concert = Concert.find(session[:concert_id])
    spotify_track_ids = @concert.setlists.sort_by(&:index).map(&:song).pluck(:spotify_id)
    spotify_tracks = []
    spotify_track_ids.each do |track_id|
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
SELECT "setlists".* FROM "setlists" WHERE "setlists"."concert_id" = $1  [["concert_id", 44]]